// const nums = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];

// 1 ~ 9 순서대로 출력해보자.

// let arr;

// for (let arr of nums) {
//   for (let num of arr) {
//     console.log(num);
//   }
// }





// 1.  행들의 합의 값으로 리스트를 만드세요
//     - [6, 15, 24],   [1 + 2 + 3,  4 + 5 + 6, 7 + 8 + 9]




// 1. 모든 원소들의 합을 구하시오
//     - 1 + 2 + 3 + 4 ... + 9



// const nums = [
//    [1,4,7]
//    [2,5,8]
//    [3,6,9]
// ];

// let arr;

// for (let arr of nums)



// 1. 열들의 합의 값으로 리스트를 만드세요
//     - [1 + 4 + 7, 2 + 5 + 8, 3 + 6 + 9]

counst gugudan = [ ]

1단 = 1 ~ 9까지의 숫자가 필요하다.

for ( let i =1; i<10; i++)
   console.log(3 * 1);

